{"config": [{"config": {"dtype": "float32", "function_type": "lambda", "name": "lambda_1", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-13-e82550ff7171>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape_type": "raw", "arguments": {}, "batch_input_shape": [null, 160, 320, 3]}, "class_name": "Lambda"}, {"config": {"kernel_size": [5, 5], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "filters": 24, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "strides": [2, 2], "trainable": true}, "class_name": "Conv2D"}, {"config": {"kernel_size": [5, 5], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "filters": 36, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "strides": [2, 2], "trainable": true}, "class_name": "Conv2D"}, {"config": {"kernel_size": [5, 5], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "filters": 48, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "strides": [2, 2], "trainable": true}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "filters": 64, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "strides": [2, 2], "trainable": true}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "filters": 64, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "strides": [2, 2], "trainable": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "use_bias": true, "units": 80, "trainable": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "use_bias": true, "units": 40, "trainable": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_3", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "use_bias": true, "units": 16, "trainable": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_4", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "use_bias": true, "units": 10, "trainable": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_5", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "units": 1, "trainable": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6"}