{"keras_version": "2.0.6", "config": [{"config": {"name": "lambda_2", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-19-4b5976ee9915>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "trainable": true, "output_shape": null, "output_shape_type": "raw", "arguments": {}, "batch_input_shape": [null, 160, 320, 3], "dtype": "float32"}, "class_name": "Lambda"}, {"config": {"name": "cropping2d_2", "cropping": [[60, 20], [20, 20]], "data_format": "channels_last", "trainable": true}, "class_name": "Cropping2D"}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 24, "kernel_size": [5, 5], "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "strides": [2, 2], "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_6", "activation": "relu", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 48, "kernel_size": [5, 5], "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "strides": [2, 2], "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_7", "activation": "relu", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 96, "kernel_size": [5, 5], "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "strides": [2, 2], "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_8", "activation": "relu", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 128, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "strides": [2, 2], "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_9", "activation": "relu", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 128, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "strides": [2, 2], "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_10", "activation": "relu", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "kernel_constraint": null, "units": 100, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "name": "dense_5", "activation": "linear"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "kernel_constraint": null, "units": 50, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "name": "dense_6", "activation": "linear"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "kernel_constraint": null, "units": 25, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "name": "dense_7", "activation": "linear"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "units": 1, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "name": "dense_8", "activation": "linear"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}