{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "trainable": true, "dtype": "float32", "output_shape": null, "output_shape_type": "raw", "batch_input_shape": [null, 160, 320, 3], "name": "lambda_1", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-17-c43b55bd48fa>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Cropping2D", "config": {"trainable": true, "name": "cropping2d_1", "cropping": [[60, 20], [20, 20]], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "kernel_constraint": null, "filters": 24, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "strides": [2, 2], "bias_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "kernel_constraint": null, "filters": 48, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "strides": [2, 2], "bias_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "kernel_constraint": null, "filters": 96, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "strides": [2, 2], "bias_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "kernel_size": [5, 5]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "kernel_constraint": null, "filters": 128, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "strides": [2, 2], "bias_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_4", "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "kernel_constraint": null, "filters": 128, "use_bias": true, "data_format": "channels_last", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "strides": [2, 2], "bias_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_5", "dilation_rate": [1, 1], "kernel_size": [3, 3]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "units": 100, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "name": "dense_1", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "units": 50, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "name": "dense_2", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "units": 25, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "name": "dense_3", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "units": 1, "kernel_regularizer": null, "name": "dense_4", "activity_regularizer": null}}], "keras_version": "2.0.6"}