{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"dtype": "float32", "arguments": {}, "trainable": true, "name": "lambda_3", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-81-9b998ca90162>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda", "output_shape": null}}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_3", "trainable": true, "cropping": [[60, 20], [20, 20]], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "same", "kernel_size": [5, 5], "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_11", "strides": [2, 2], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 24, "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"padding": "same", "kernel_size": [5, 5], "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_12", "strides": [2, 2], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 48, "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"padding": "same", "kernel_size": [5, 5], "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_13", "strides": [2, 2], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 96, "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_14", "strides": [2, 2], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 128, "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_15", "strides": [2, 2], "use_bias": true, "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 128, "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_9", "units": 100, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_10", "units": 50, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_11", "units": 25, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_12", "units": 1, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null}}], "keras_version": "2.0.6", "backend": "tensorflow"}