{"class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Lambda", "config": {"trainable": true, "output_shape": null, "name": "lambda_4", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-77-de6de5a73af0>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "arguments": {}, "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Conv2D", "config": {"trainable": true, "filters": 3, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "kernel_size": [1, 1], "name": "conv2d_15", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "filters": 8, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "kernel_size": [5, 5], "name": "conv2d_16", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "filters": 16, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "kernel_size": [5, 5], "name": "conv2d_17", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_7", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"trainable": true, "filters": 16, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "kernel_size": [5, 5], "name": "conv2d_18", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "filters": 32, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "kernel_size": [5, 5], "name": "conv2d_19", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_8", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"trainable": true, "filters": 32, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "kernel_size": [5, 5], "name": "conv2d_20", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "filters": 64, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "kernel_size": [5, 5], "name": "conv2d_21", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_9", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "name": "dense_7", "activation": "relu", "units": 1024, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "name": "dense_8", "activation": "relu", "units": 512, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "name": "dense_9", "activation": "linear", "units": 1, "kernel_regularizer": null, "activity_regularizer": null}}], "backend": "tensorflow"}