{"keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Lambda", "config": {"trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-20-c43b55bd48fa>\u00da\b<lambda>\u0005\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda", "dtype": "float32", "output_shape_type": "raw", "output_shape": null}}, {"class_name": "Cropping2D", "config": {"trainable": true, "data_format": "channels_last", "cropping": [[60, 20], [20, 20]], "name": "cropping2d_1"}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "strides": [2, 2], "padding": "same", "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_size": [5, 5], "filters": 24, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_1", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "strides": [2, 2], "padding": "same", "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_size": [5, 5], "filters": 48, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_2", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "strides": [2, 2], "padding": "same", "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_size": [5, 5], "filters": 96, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_3", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "strides": [2, 2], "padding": "same", "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_size": [3, 3], "filters": 128, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_4", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "strides": [2, 2], "padding": "same", "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_size": [3, 3], "filters": 128, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "name": "conv2d_5", "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "units": 100, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "name": "dense_2", "bias_constraint": null, "units": 50, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "name": "dense_3", "bias_constraint": null, "units": 25, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "name": "dense_4", "bias_constraint": null, "units": 1, "bias_regularizer": null}}]}