{"config": [{"config": {"dtype": "float32", "arguments": {}, "trainable": true, "name": "lambda_13", "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-69-4b5976ee9915>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"trainable": true, "name": "cropping2d_4", "data_format": "channels_last", "cropping": [[60, 20], [20, 20]]}, "class_name": "Cropping2D"}, {"config": {"kernel_size": [5, 5], "name": "conv2d_56", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 24, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "padding": "same", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_size": [5, 5], "name": "conv2d_57", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 48, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "padding": "same", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_size": [5, 5], "name": "conv2d_58", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 96, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "padding": "same", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "name": "conv2d_59", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 128, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "padding": "same", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "name": "conv2d_60", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 128, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "padding": "same", "trainable": true, "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_12"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "name": "dense_44", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "trainable": true, "bias_constraint": null, "units": 100, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "name": "dense_45", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "trainable": true, "bias_constraint": null, "units": 50, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "name": "dense_46", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "trainable": true, "bias_constraint": null, "units": 25, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "name": "dense_47", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "units": 1, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6"}